/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ls1x_spi.h
**
** 创   建   人: Ryan.Xin (信金龙)
**
** 文件创建日期: 2015 年 12 月 20 日
**
** 描        述: Loongson1B 处理器 SPI 驱动(总线驱动部分)
*********************************************************************************************************/

#ifndef LS1X_SPI_H_
#define LS1X_SPI_H_

#define LS1XSPI0    (0)
#define LS1XSPI1    (1)

#define SPI_CS0     (0)
#define SPI_CS1     (1)
#define SPI_CS2     (2)
#define SPI_CS3     (3)

/*********************************************************************************************************
** 函数名称: SPIPO_pfuncChipSelect
** 功能描述: 初始化 spi 总线并获取驱动程序
** 输　入  : iMasterID  BUS Number
**         : iDeviceID  Slave Device CS
**         : bEnable    Enable or Disable Device
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID ls1xSpipfuncChipSelect(UINT  iMasterID, UINT iDeviceID, BOOL bEnable);

/*********************************************************************************************************
** 函数名称: spiBusDrv
** 功能描述: 初始化 spi 总线并获取驱动程序
** 输　入  : uiChannel         通道号
** 输　出  : spi 总线驱动程序
** 全局变量:
** 调用模块:
*********************************************************************************************************/
PLW_SPI_FUNCS  spiBusDrv(UINT  uiChannel);

#endif                                                                  /* LS1X_SPI_H_                  */
/*********************************************************************************************************
  END
*********************************************************************************************************/
