/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: designware_eth.c
**
** 创   建   人: Jiao.JinXing
**
** 文件创建日期: 2015 年 10 月 29 日
**
** 描        述: designware 以太网芯片驱动.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
#include "netif/etharp.h"
#include "lwip/ethip6.h"
#include "lwip/netif.h"
#include "lwip/sys.h"
#include "lwip/stats.h"
#include "lwip/snmp.h"
#include <linux/compat.h>
#include "designware_eth.h"

#define CONFIG_DW_GMAC_DEFAULT_DMA_PBL  16
#include "designware_eth_priv.h"
/*********************************************************************************************************
  配置
*********************************************************************************************************/
#define IFNAME0                 'e'
#define IFNAME1                 'n'

#define HOSTNAME                "lwIP"

#define CONFIG_TX_DESCR_NUM     32
#define CONFIG_RX_DESCR_NUM     32
#define CONFIG_ETH_BUFSIZE      2048
#define TX_TOTAL_BUFSIZE        (CONFIG_ETH_BUFSIZE * CONFIG_TX_DESCR_NUM)
#define RX_TOTAL_BUFSIZE        (CONFIG_ETH_BUFSIZE * CONFIG_RX_DESCR_NUM)
/*********************************************************************************************************
  MAC 寄存器定义
*********************************************************************************************************/
typedef struct {
    UINT32                      MAC_uiConfig;                           /*  0x00                        */
    UINT32                      MAC_uiFrameFilt;                        /*  0x04                        */
    UINT32                      MAC_uiHashTableHigh;                    /*  0x08                        */
    UINT32                      MAC_uiHashTableLow;                     /*  0x0c                        */
    UINT32                      MAC_uiMiiAddr;                          /*  0x10                        */
    UINT32                      MAC_uiMiiData;                          /*  0x14                        */
    UINT32                      MAC_uiFlowControl;                      /*  0x18                        */
    UINT32                      MAC_uiVlanTag;                          /*  0x1c                        */
    UINT32                      MAC_uiVersion;                          /*  0x20                        */
    UINT8                       reserved_1[20];
    UINT32                      MAC_uiIntReg;                           /*  0x38                        */
    UINT32                      MAC_uiIntMask;                          /*  0x3c                        */
    UINT32                      MAC_uiMacAddr0Hi;                       /*  0x40                        */
    UINT32                      MAC_uiMacAddr0Lo;                       /*  0x44                        */
} __ETH_MAC_REGS, *__PETH_MAC_REGS;
/*********************************************************************************************************
  DMA 寄存器定义
*********************************************************************************************************/
typedef struct {
    UINT32                      DMA_uiBusMode;                          /*  0x00                        */
    UINT32                      DMA_uiTxPollDemand;                     /*  0x04                        */
    UINT32                      DMA_uiRxPollDemand;                     /*  0x08                        */
    UINT32                      DMA_uiRxDescListAddr;                   /*  0x0c                        */
    UINT32                      DMA_uiTxDescListAddr;                   /*  0x10                        */
    UINT32                      DMA_uiStatus;                           /*  0x14                        */
    UINT32                      DMA_uiOpMode;                           /*  0x18                        */
    UINT32                      DMA_uiIntEnable;                        /*  0x1c                        */
    UINT32                      reserved1[2];
    UINT32                      DMA_uiAxiBus;                           /*  0x28                        */
    UINT32                      reserved2[7];
    UINT32                      DMA_uiCurrHostTxDesc;                   /*  0x48                        */
    UINT32                      DMA_uiCurrHostRxDesc;                   /*  0x4c                        */
    UINT32                      DMA_uiCurrHostTxBuffAddr;               /*  0x50                        */
    UINT32                      DMA_uiCurrHostRxBuffAddr;               /*  0x54                        */
} __ETH_DMA_REGS, *__PETH_DMA_REGS;
/*********************************************************************************************************
  DMA MAC 描述符定义
*********************************************************************************************************/
struct __ST_DMA_MAC_DESCR {
    volatile UINT32             DESCR_uiTxRxStatus;
    volatile UINT32             DESCR_uiCntl;
    PVOID                       DESCR_pvAddr;
    struct __ST_DMA_MAC_DESCR  *DESCR_pNest;
} __attribute__ ((aligned(ARCH_DMA_MINALIGN)));
typedef struct __ST_DMA_MAC_DESCR __DMA_MAC_DESCR, *__PDMA_MAC_DESCR;
/*********************************************************************************************************
  以太网接口数据结构定义
*********************************************************************************************************/
typedef struct {
    addr_t                      ETH_ulBase;

